# yolov8n_custom.yaml
# YOLOv8 nano model, custom for 12 classes

backbone:
  [[-1, 1, Conv, [16, 3, 2]],      # 0-P1/2
   [-1, 1, Conv, [32, 3, 2]],      # 1-P2/4
   [-1, 1, C2f, [32, 1]],          # 2
   [-1, 1, Conv, [64, 3, 2]],      # 3-P3/8
   [-1, 2, C2f, [64, 2]],          # 4
   [-1, 1, Conv, [128, 3, 2]],     # 5-P4/16
   [-1, 2, C2f, [128, 2]],         # 6
   [-1, 1, Conv, [256, 3, 2]],     # 7-P5/32
   [-1, 1, C2f, [256, 1]],         # 8
   [-1, 1, SPPF, [256, 5]],        # 9
  ]

head:
  [[-1, 1, Conv, [128, 1, 1]],    # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],      # 12
   [-1, 1, C2f, [128, 1]],         # 13

   [-1, 1, Conv, [64, 1, 1]],      # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15
   [[-1, 4], 1, Concat, [1]],      # 16
   [-1, 1, C2f, [64, 1]],          # 17

   [-1, 1, Conv, [64, 3, 2]],      # 18
   [[-1, 14], 1, Concat, [1]],     # 19
   [-1, 1, C2f, [128, 1]],         # 20

   [-1, 1, Conv, [128, 3, 2]],     # 21
   [[-1, 9], 1, Concat, [1]],      # 22
   [-1, 1, C2f, [256, 1]],         # 23

   [[17, 20, 23], 1, Detect, [12]], # 24 (Detect) - 12 classes
  ]
